In [60]:
import pandas as pd
import numpy as np

In [61]:
# dataframe == schema(db, table)

In [62]:
# dataframe을 만드는 방법
# 1. 외부파일을 읽어온다.(scv, xlsx) ==> data
# 2. 데이터구조를 가지고 dataframe을 만들어주면 된다.
#    dic, list

In [63]:
# 항목명1    항목명2    항목명3    
# ---------------------------------
# 100       200         300
# 100       200         300

#{"항목명1" : [100,100], "항목명2" : [200,200]}

In [64]:
df = pd.DataFrame({"name" : ['홍길동', '박길동'],
             "age" : [100,30],
             "ex" : [1,2]})

In [65]:
df['name']

0    홍길동
1    박길동
Name: name, dtype: object

In [66]:
df['ex']

0    1
1    2
Name: ex, dtype: int64

In [67]:
df.describe() # 수치항목에 대해서만! 요약
# 개수, 평균(mean), 표준편차(std), min(최소값), max(최대값)
# 25%, 50%, 70%, 100%(4분위수)

              age        ex
count    2.000000  2.000000
mean    65.000000  1.500000
std     49.497475  0.707107
min     30.000000  1.000000
25%     47.500000  1.250000
50%     65.000000  1.500000
75%     82.500000  1.750000
max    100.000000  2.000000

In [68]:
import random
name_list = []
age_list = []
ex_list = []
for i in range(1000):
    name_list.append('이름' + str(i))
    age_list.append(random.randint(1, 120))
    ex_list.append(random.randint(1,2))
len(name_list), len(age_list), len(ex_list)

(1000, 1000, 1000)

In [69]:
name_list[:5], age_list[:5], ex_list[:5]

(['이름0', '이름1', '이름2', '이름3', '이름4'], [49, 8, 6, 15, 20], [2, 2, 2, 1, 2])

In [70]:
df2 = pd.DataFrame({"name" : name_list,
             "age" : age_list,
             "ex" : ex_list})
#1. df로 만들어보고,
#2. 데이터타입을 확인해보고, 
#3. 각 컬럼을 추춘해보고, 
#4. 숫자형 컬럼의 요약을 해보세요.

In [71]:
df2.dtypes

name    object
age      int64
ex       int64
dtype: object

In [72]:
df2.columns

Index(['name', 'age', 'ex'], dtype='object')

In [73]:
df2['age'], df2['ex'] #데이터프레임[컬럼]

(0       49
 1        8
 2        6
 3       15
 4       20
       ...
 995     14
 996      3
 997    104
 998     93
 999     91
 Name: age, Length: 1000, dtype: int64, 0      2
 1      2
 2      2
 3      1
 4      2
       ..
 995    2
 996    1
 997    2
 998    1
 999    2
 Name: ex, Length: 1000, dtype: int64)

In [74]:
df2.age, df2.ex

(0       49
 1        8
 2        6
 3       15
 4       20
       ...
 995     14
 996      3
 997    104
 998     93
 999     91
 Name: age, Length: 1000, dtype: int64, 0      2
 1      2
 2      2
 3      1
 4      2
       ..
 995    2
 996    1
 997    2
 998    1
 999    2
 Name: ex, Length: 1000, dtype: int64)

In [75]:
df2['age'] > 50 #브로드캐스팅

0      False
1      False
2      False
3      False
4      False
       ...
995    False
996    False
997     True
998     True
999     True
Name: age, Length: 1000, dtype: bool

In [76]:
df2['age'] - 10 #브로드캐스팅
#원본을 가져다가 처리하므로, df2는 바뀌지 않음
#(비파괴 연산)

0      39
1      -2
2      -4
3       5
4      10
       ..
995     4
996    -7
997    94
998    83
999    81
Name: age, Length: 1000, dtype: int64

In [77]:
df2['age2'] = df2['age'] - 10

In [78]:
df2

      name  age  ex  age2
0      이름0   49   2    39
1      이름1    8   2    -2
2      이름2    6   2    -4
3      이름3   15   1     5
4      이름4   20   2    10
..     ...  ...  ..   ...
995  이름995   14   2     4
996  이름996    3   1    -7
997  이름997  104   2    94
998  이름998   93   1    83
999  이름999   91   2    81

[1000 rows x 4 columns]

df2['name'] = df2['name'] + '님'
df2['name']

In [80]:
df2.describe()

               age           ex         age2
count  1000.000000  1000.000000  1000.000000
mean     59.482000     1.499000    49.482000
std      33.986302     0.500249    33.986302
min       1.000000     1.000000    -9.000000
25%      30.750000     1.000000    20.750000
50%      59.000000     1.000000    49.000000
75%      89.000000     2.000000    79.000000
max     120.000000     2.000000   110.000000

In [90]:
df2['age'][df2['age']>110]

5      115
6      120
81     120
104    120
118    114
      ...
916    119
936    115
974    119
981    116
985    115
Name: age, Length: 67, dtype: int64

In [95]:
df2.loc[100] #loc[행]

name    이름100
age        35
ex          1
age2       25
Name: 100, dtype: object

In [102]:
df2.loc[:,'age']

0       49
1        8
2        6
3       15
4       20
      ...
995     14
996      3
997    104
998     93
999     91
Name: age, Length: 1000, dtype: int64

In [106]:
df2.loc[:, 'name':'age2']

      name  age  ex  age2
0      이름0   49   2    39
1      이름1    8   2    -2
2      이름2    6   2    -4
3      이름3   15   1     5
4      이름4   20   2    10
..     ...  ...  ..   ...
995  이름995   14   2     4
996  이름996    3   1    -7
997  이름997  104   2    94
998  이름998   93   1    83
999  이름999   91   2    81

[1000 rows x 4 columns]

In [111]:
df2['add_column'] = df2['age'] + df2['ex'] 
#기존의 컬럼에 컬럼 추가 가능
# df[새로 만들고 싶은 컬럼명] = df[기존 컬럼] + df[기존컬럼]

In [114]:
df2['next_age'] = df2['age'] + 1
df2

      name  age  ex  age2  add_column  next_age
0      이름0   49   2    39          51        50
1      이름1    8   2    -2          10         9
2      이름2    6   2    -4           8         7
3      이름3   15   1     5          16        16
4      이름4   20   2    10          22        21
..     ...  ...  ..   ...         ...       ...
995  이름995   14   2     4          16        15
996  이름996    3   1    -7           4         4
997  이름997  104   2    94         106       105
998  이름998   93   1    83          94        94
999  이름999   91   2    81          93        92

[1000 rows x 6 columns]

In [119]:
df2.loc[0, 'name']

'이름0'

In [120]:
df2.iloc[0, 1]

49

In [123]:
df2.loc[0,'add_column'] = 10
df2.iloc[3,4] = 20
df2

      name  age  ex  age2  add_column  next_age
0      이름0   49   2    39          10        50
1      이름1    8   2    -2          10         9
2      이름2    6   2    -4           8         7
3      이름3   15   1     5          20        16
4      이름4   20   2    10          22        21
..     ...  ...  ..   ...         ...       ...
995  이름995   14   2     4          16        15
996  이름996    3   1    -7           4         4
997  이름997  104   2    94         106       105
998  이름998   93   1    83          94        94
999  이름999   91   2    81          93        92

[1000 rows x 6 columns]

In [131]:
index = df.index
print(index)

RangeIndex(start=0, stop=2, step=1)

In [141]:
df2.values #중요!!!중요!!!-> nd array클래스
# n: 숫자(차원수, 1차원이면 1, 2차원 2)
# d: 차원(dimention)
# array: list
# 판다스에는 여러 차원의 데이터를 하나의 클래스로 처리하기(다루기) 위해서
# 여러 차원의 데이터를 다룰 수 있는 ndarray를 만들어 놓았음.

array([['이름0', 49, 2, 39, 10, 50],
       ['이름1', 8, 2, -2, 10, 9],
       ['이름2', 6, 2, -4, 8, 7],
       ...,
       ['이름997', 104, 2, 94, 106, 105],
       ['이름998', 93, 1, 83, 94, 94],
       ['이름999', 91, 2, 81, 93, 92]], dtype=object)

In [140]:
c = df2.to_csv
c

<bound method NDFrame.to_csv of       name  age  ex  age2  add_column  next_age
0      이름0   49   2    39          10        50
1      이름1    8   2    -2          10         9
2      이름2    6   2    -4           8         7
3      이름3   15   1     5          20        16
4      이름4   20   2    10          22        21
..     ...  ...  ..   ...         ...       ...
995  이름995   14   2     4          16        15
996  이름996    3   1    -7           4         4
997  이름997  104   2    94         106       105
998  이름998   93   1    83          94        94
999  이름999   91   2    81          93        92

[1000 rows x 6 columns]>

In [1]:
df2.loc[1][2]

NameError: name 'df2' is not defined